micropython/micropython/lib/stm32n6/STM32N6xx_HAL_Driver/Inc/stm32n6xx_hal_rcc.h
/**
  ******************************************************************************
  * @file    stm32n6xx_hal_rcc.h
  * @author  MCD Application Team
  * @brief   Header file of RCC HAL module.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2023 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file in
  * the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef STM32N6xx_HAL_RCC_H
#define STM32N6xx_HAL_RCC_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32n6xx_hal_def.h"
#include "stm32n6xx_ll_bus.h"
#include "stm32n6xx_ll_rcc.h"

/** @addtogroup STM32N6xx_HAL_Driver
  * @{
  */

/** @addtogroup RCC
  * @{
  */

/* Exported types ------------------------------------------------------------*/

/** @defgroup RCC_Exported_Types RCC Exported Types
  * @{
  */

/**
  * @brief  RCC PLL configuration structure definition
  *         (allow to configure the PLL in integer and fractional modes)
  *         Only PLLState field is applicable when its value is different from RCC_PLL_ON
  */
typedef struct
{
  uint32_t PLLState;            /*!< The new state of the PLL.
                                     This parameter can be a value of @ref RCC_PLL_Config            */

  uint32_t PLLSource;           /*!< PLL entry clock source.
                                     This parameter must be a value of @ref RCC_PLL_Clock_Source     */

  uint32_t PLLM;                /*!< Division factor M for PLL VCO input clock.
                                     This parameter must be a number between Min_Data = 1 and Max_Data = 63    */

  uint32_t PLLFractional;       /*!< Fractional part of he VCO mulliplication factor.
                                     This parameter must be a number between Min_Data = 0 and Max_Data = 0xFFFFFF */

  uint32_t PLLN;                /*!< Multiplication factor N for PLL VCO output clock.
                                     In integer mode, this parameter must be a number between Min_Data = 10 and Max_Data = 2500.
                                     In fractional mode, this parameter must be a number between Min_Data = 20 and Max_Data = 500.*/

  uint32_t PLLP1;               /*!< Division factor P1 for system clock.
                                     This parameter must be a number between Min_Data = 1 and Max_Data = 7     */

  uint32_t PLLP2;               /*!< Division factor P2 for system clock.
                                     This parameter must be a number between Min_Data = 1 and Max_Data = 7     */

} RCC_PLLInitTypeDef;

/**
  * @brief  RCC Internal/External Oscillator (HSE, HSI, MSI, LSE and LSI) and PLLs configuration structure definition
  */
typedef struct
{
  uint32_t OscillatorType;       /*!< The oscillators to be configured.
                                      This parameter can be a value of @ref RCC_Oscillator_Type                   */

  uint32_t HSEState;             /*!< The new state of the HSE.
                                      This parameter can be a value of @ref RCC_HSE_Config                        */

  uint32_t LSEState;             /*!< The new state of the LSE.
                                      This parameter can be a value of @ref RCC_LSE_Config                        */

  uint32_t HSIState;             /*!< The new state of the HSI.
                                      This parameter can be a value of @ref RCC_HSI_Config                        */

  uint32_t HSIDiv;               /*!< The division factor of the HSI.
                                      This parameter can be a value of @ref RCC_HSI_Div                           */

  uint32_t HSICalibrationValue;  /*!< The calibration trimming value.
                                      This parameter must be a number between Min_Data = 0 and Max_Data = 127     */

  uint32_t LSIState;             /*!< The new state of the LSI.
                                      This parameter can be a value of @ref RCC_LSI_Config                        */

  uint32_t MSIState;             /*!< The new state of the MSI.
                                      This parameter can be a value of @ref RCC_MSI_Config */

  uint32_t MSIFrequency;         /*!< The MSI frequency selection.
                                      This parameter can be a value of @ref RCC_MSI_Frequency */

  uint32_t MSICalibrationValue;  /*!< The calibration trimming value.
                                      This parameter must be a number between Min_Data = 0 and Max_Data = 31      */

  RCC_PLLInitTypeDef PLL1;       /*!< PLL1 structure parameters                                                   */

  RCC_PLLInitTypeDef PLL2;       /*!< PLL2 structure parameters                                                   */

  RCC_PLLInitTypeDef PLL3;       /*!< PLL3 structure parameters                                                   */

  RCC_PLLInitTypeDef PLL4;       /*!< PLL4 structure parameters                                                   */

} RCC_OscInitTypeDef;

/**
  * @brief  RCC extended interconnection structure definition
  */
typedef struct
{
  uint32_t  ClockSelection;        /*!< Specifies ICx clock source.
                                        This parameter can be a value of @ref RCC_IC_Clock_Source */

  uint32_t  ClockDivider;          /*!< Specifies ICx clock divider.
                                        This parameter must be a number between Min_Data = 1 and Max_Data = 256 */
} RCC_ICInitTypeDef;

/**
  * @brief  RCC System, AHB and APB busses clock configuration structure definition
  */
typedef struct
{
  uint32_t ClockType;             /*!< The clock to be configured.
                                       This parameter can be a value of @ref RCC_Clock_Type                           */

  uint32_t CPUCLKSource;          /*!< The clock source used as CPU clock (CPUCLK).
                                       This parameter can be a value of @ref RCC_CPU_Clock_Source                     */

  uint32_t SYSCLKSource;          /*!< The clock source used as system bus clock (SYSCLK).
                                       This parameter can be a value of @ref RCC_System_Bus_Clock_Source              */

