micropython/micropython/lib/stm32n6/STM32N6xx_HAL_Driver/Inc/stm32n6xx_hal_rcc.h
  uint32_t AHBCLKDivider;         /*!< The AHB clock divider for HCLK.
                                       This clock is derived from the system clock divided by the system clock divider.
                                       This parameter can be a value of @ref RCC_HCLK_Clock_Source                    */

  uint32_t APB1CLKDivider;        /*!< The APB1 clock divider for PCLK1.
                                       This clock is derived from the AHB clock (HCLK).
                                       This parameter can be a value of @ref RCC_APB1_Clock_Source                    */

  uint32_t APB2CLKDivider;        /*!< The APB2 clock divider for PCLK2.
                                       This clock is derived from the AHB clock (HCLK).
                                       This parameter can be a value of @ref RCC_APB2_Clock_Source                    */

  uint32_t APB4CLKDivider;        /*!< The APB4 clock divider for PCLK4.
                                       This clock is derived from the AHB clock (HCLK).
                                       This parameter can be a value of @ref RCC_APB4_Clock_Source                    */

  uint32_t APB5CLKDivider;        /*!< The APB5 clock divider for PCLK5.
                                       This clock is derived from the AHB clock (HCLK).
                                       This parameter can be a value of @ref RCC_APB5_Clock_Source                    */

  RCC_ICInitTypeDef IC1Selection; /*!< IC1 parameters.
                                       This parameter shall be used when IC1 is selected as CPU clock source (sysa_ck)         */

  RCC_ICInitTypeDef IC2Selection; /*!< IC2 parameters.
                                       This parameter shall be used when IC2 is selected as system bus clock source (sysb_ck)  */

  RCC_ICInitTypeDef IC6Selection; /*!< IC6 parameters.
                                       This parameter shall be used when IC6 is selected as system bus clock source (sysc_ck)  */

  RCC_ICInitTypeDef IC11Selection; /*!< IC11 parameters.
                                       This parameter shall be used when IC11 is selected as system bus clock source (sysd_ck) */
} RCC_ClkInitTypeDef;

/**
  * @}
  */

/* Exported constants --------------------------------------------------------*/

/** @defgroup RCC_Exported_Constants RCC Exported Constants
  * @{
  */

/** @defgroup RCC_Oscillator_Type  Oscillator Type
  * @{
  */
#define RCC_OSCILLATORTYPE_NONE        0x00U  /*!< Oscillator configuration unchanged */
#define RCC_OSCILLATORTYPE_HSE         0x01U  /*!< HSE selected */
#define RCC_OSCILLATORTYPE_HSI         0x02U  /*!< HSI selected */
#define RCC_OSCILLATORTYPE_LSE         0x04U  /*!< LSE selected */
#define RCC_OSCILLATORTYPE_LSI         0x08U  /*!< LSI selected */
#define RCC_OSCILLATORTYPE_MSI         0x10U  /*!< MSI selected */
/**
  * @}
  */

/** @defgroup RCC_HSE_Config  HSE Config
  * @{
  */
#define RCC_HSE_OFF                    0U                                                       /*!< HSE clock deactivation */
#define RCC_HSE_ON                     RCC_CR_HSEON                                             /*!< HSE clock activation */
#define RCC_HSE_BYPASS                 (RCC_HSECFGR_HSEBYP | RCC_CR_HSEON)                      /*!< HSE bypass analog clock activation */
#define RCC_HSE_BYPASS_DIGITAL         (RCC_HSECFGR_HSEEXT | RCC_HSECFGR_HSEBYP | RCC_CR_HSEON) /*!< HSE bypass digital clock activation */
/**
  * @}
  */

/** @defgroup RCC_LSE_Config  LSE Config
  * @{
  */
#define RCC_LSE_OFF                    0U                                                       /*!< LSE clock deactivation */
#define RCC_LSE_ON                     RCC_CR_LSEON                                             /*!< LSE clock activation */
#define RCC_LSE_BYPASS                 (RCC_LSECFGR_LSEBYP | RCC_CR_LSEON)                      /*!< LSE bypass analog clock activation */
#define RCC_LSE_BYPASS_DIGITAL         (RCC_LSECFGR_LSEEXT | RCC_LSECFGR_LSEBYP | RCC_CR_LSEON) /*!< LSE bypass digital clock activation */
/**
  * @}
  */

/** @defgroup RCC_HSI_Config  HSI Config
  * @{
  */
#define RCC_HSI_OFF                    0U                   /*!< HSI clock deactivation */
#define RCC_HSI_ON                     RCC_CR_HSION         /*!< HSI clock activation */
/**
  * @}
  */

/** @defgroup RCC_HSI_Div HSI Clock Divider
  * @{
  */
#define RCC_HSI_DIV1                   LL_RCC_HSI_DIV_1  /*!< HSI clock is not divided */
#define RCC_HSI_DIV2                   LL_RCC_HSI_DIV_2  /*!< HSI clock is divided by 2 */
#define RCC_HSI_DIV4                   LL_RCC_HSI_DIV_4  /*!< HSI clock is divided by 4 */
#define RCC_HSI_DIV8                   LL_RCC_HSI_DIV_8  /*!< HSI clock is divided by 8 */
/**
  * @}
  */

/** @defgroup RCC_HSI_Calibration_Default  HSI Calibration default
  * @{
  */
#define RCC_HSICALIBRATION_DEFAULT     0U                  /*!< Default HSI calibration trimming value */
/**
  * @}
  */

/** @defgroup RCC_LSI_Config  LSI Config
  * @{
  */
#define RCC_LSI_OFF                    0U                  /*!< LSI clock deactivation */
#define RCC_LSI_ON                     RCC_CR_LSION        /*!< LSI clock activation */
/**
  * @}
  */

/** @defgroup RCC_MSI_Config  MSI Config
  * @{
  */
#define RCC_MSI_OFF                    0U                  /*!< MSI clock deactivation */
#define RCC_MSI_ON                     RCC_CR_MSION        /*!< MSI clock activation */
/**
  * @}
  */

/** @defgroup RCC_MSI_Frequency  MSI Frequency
  * @{
  */
#define RCC_MSI_FREQ_4MHZ              LL_RCC_MSI_FREQ_4MHZ  /*!< MSI 4MHz selection */
#define RCC_MSI_FREQ_16MHZ             LL_RCC_MSI_FREQ_16MHZ /*!< MSI 16MHz selection */
/**
  * @}
  */

/** @defgroup RCC_MSI_Calibration_Default  MSI Calibration default
  * @{
  */
#define RCC_MSICALIBRATION_DEFAULT     0U                  /*!< Default MSI calibration trimming value */
/**
  * @}
  */

/** @defgroup RCC_PLL_Config  PLL Config
  * @{
  */
#define RCC_PLL_NONE                   0U                  /*!< PLL configuration unchanged */
#define RCC_PLL_OFF                    1U                  /*!< PLL deactivation */
#define RCC_PLL_ON                     2U                  /*!< PLL activation */
#define RCC_PLL_BYPASS                 3U                  /*!< PLL activation in bypass mode with FREF set as source */
/**
  * @}
  */

/** @defgroup RCC_PLL_Clock_Source  PLL Clock Source
  * @{
  */
#define RCC_PLLSOURCE_HSI              LL_RCC_PLLSOURCE_HSI      /*!< HSI clock selected as PLL entry clock source */
#define RCC_PLLSOURCE_MSI              LL_RCC_PLLSOURCE_MSI      /*!< MSI clock selected as PLL entry clock source */
#define RCC_PLLSOURCE_HSE              LL_RCC_PLLSOURCE_HSE      /*!< HSE clock selected as PLL entry clock source */
#define RCC_PLLSOURCE_PIN              LL_RCC_PLLSOURCE_I2S_CKIN /*!< External clock I2S_CKIN selected as PLL entry clock source  */
/**
  * @}
  */

/** @defgroup RCC_Clock_Type  Clock Type
  * @{
  */
#define RCC_CLOCKTYPE_CPUCLK           0x01U         /*!< CPU clock to configure */
#define RCC_CLOCKTYPE_SYSCLK           0x02U         /*!< System bus clock to configure for AXI */
#define RCC_CLOCKTYPE_HCLK             0x04U         /*!< HCLK to configure for AHB */
#define RCC_CLOCKTYPE_PCLK1            0x08U         /*!< PCLK1 to configure for APB1 */
#define RCC_CLOCKTYPE_PCLK2            0x10U         /*!< PCLK2 to configure for APB2 */
#define RCC_CLOCKTYPE_PCLK4            0x20U         /*!< PCLK4 to configure for APB4 */
#define RCC_CLOCKTYPE_PCLK5            0x40U         /*!< PCLK5 to configure for APB5 */
/**
  * @}
  */

/** @defgroup RCC_CPU_Clock_Source  CPU Clock Source
  * @{
  */
#define RCC_CPUCLKSOURCE_HSI           LL_RCC_CPU_CLKSOURCE_HSI  /*!< HSI selection as CPU clock */
#define RCC_CPUCLKSOURCE_MSI           LL_RCC_CPU_CLKSOURCE_MSI  /*!< MSI selection as CPU clock */
#define RCC_CPUCLKSOURCE_HSE           LL_RCC_CPU_CLKSOURCE_HSE  /*!< HSE selection as CPU clock */
#define RCC_CPUCLKSOURCE_IC1           LL_RCC_CPU_CLKSOURCE_IC1  /*!< IC1 selection as CPU clock */
/**
  * @}
  */

/** @defgroup RCC_CPU_Clock_Source_Status CPU Clock Source Status
  * @{
  */
#define RCC_CPUCLKSOURCE_STATUS_HSI    LL_RCC_CPU_CLKSOURCE_STATUS_HSI  /*!< HSI used as CPU clock */
#define RCC_CPUCLKSOURCE_STATUS_MSI    LL_RCC_CPU_CLKSOURCE_STATUS_MSI  /*!< MSI used as CPU clock */
#define RCC_CPUCLKSOURCE_STATUS_HSE    LL_RCC_CPU_CLKSOURCE_STATUS_HSE  /*!< HSE used as CPU clock */
#define RCC_CPUCLKSOURCE_STATUS_IC1    LL_RCC_CPU_CLKSOURCE_STATUS_IC1  /*!< IC1 used as CPU clock */
/**
  * @}
  */

/** @defgroup RCC_System_Bus_Clock_Source  System Bus Clock Source
  * @{
  */
#define RCC_SYSCLKSOURCE_HSI           LL_RCC_SYS_CLKSOURCE_HSI  /*!< HSI selection as system bus clocks */
#define RCC_SYSCLKSOURCE_MSI           LL_RCC_SYS_CLKSOURCE_MSI  /*!< MSI selection as system bus clocks */
#define RCC_SYSCLKSOURCE_HSE           LL_RCC_SYS_CLKSOURCE_HSE  /*!< HSE selection as system bus clocks */
#define RCC_SYSCLKSOURCE_IC2_IC6_IC11  LL_RCC_SYS_CLKSOURCE_IC2_IC6_IC11 /*!< IC2/IC6/IC11 selection as system bus clocks */
/**
  * @}
  */

/** @defgroup RCC_System_Bus_Clock_Source_Status System Bus Clock Source Status
  * @{
  */
#define RCC_SYSCLKSOURCE_STATUS_HSI          LL_RCC_SYS_CLKSOURCE_STATUS_HSI  /*!< HSI used as system bus clocks */
#define RCC_SYSCLKSOURCE_STATUS_MSI          LL_RCC_SYS_CLKSOURCE_STATUS_MSI  /*!< MSI used as system bus clocks */
#define RCC_SYSCLKSOURCE_STATUS_HSE          LL_RCC_SYS_CLKSOURCE_STATUS_HSE  /*!< HSE used as system bus clocks */
#define RCC_SYSCLKSOURCE_STATUS_IC2_IC6_IC11 LL_RCC_SYS_CLKSOURCE_STATUS_IC2_IC6_IC11  /*!< IC2/IC6/IC11 used as system bus clocks */
/**
  * @}
  */

