micropython/micropython/lib/stm32n6/STM32N6xx_HAL_Driver/Inc/stm32n6xx_hal_rcc.h
#define __HAL_RCC_HSI_DISABLE() LL_RCC_HSI_Disable()

/** @brief  Macro to adjust the Internal High Speed 64MHz oscillator (HSI) calibration value.
  * @note   The calibration is used to compensate for the variations in voltage
  *         and temperature that influence the frequency of the internal HSI RC.
  * @param  __HSICALIBRATIONVALUE__ specifies the calibration trimming value
  *         (default is RCC_HSICALIBRATION_DEFAULT).
  *         This parameter must be a number between 0 and 127.
  * @retval None
  */
#define __HAL_RCC_HSI_CALIBRATIONVALUE_ADJUST(__HSICALIBRATIONVALUE__) \
  LL_RCC_HSI_SetCalibTrimming((uint32_t)(__HSICALIBRATIONVALUE__));

/**
  * @brief    Macros to enable or disable the force of the Internal High Speed oscillator (HSI)
  *           in STOP mode to be quickly available as kernel clock for some peripherals.
  * @note     Keeping the HSI ON in STOP mode allows to avoid slowing down the communication
  *           speed because of the HSI start-up time.
  * @note     The enable of this function has not effect on the HSION bit.
  *           This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
#define __HAL_RCC_HSISTOP_ENABLE()     LL_RCC_HSI_EnableInStopMode()

#define __HAL_RCC_HSISTOP_DISABLE()    LL_RCC_HSI_DisableInStopMode()

/**
  * @brief  Macros to enable or disable the Internal oscillator (MSI).
  * @note     The MSI is stopped by hardware when entering STOP and STANDBY modes.
  *           It is used (enabled by hardware) as system clock source after
  *           start-up from Reset, wakeup from STOP and STANDBY mode, or in case
  *           of failure of the HSE used directly or indirectly as system clock
  *           (if the Clock Security System CSS is enabled).
  * @note     MSI can not be stopped if it is used as system clock source.
  *           In this case, you have to select another source of the system
  *           clock then stop the MSI.
  * @note     After enabling the MSI, the application software should wait on
  *           MSIRDY flag to be set indicating that MSI clock is stable and can
  *           be used as system clock source.
  * @note     When the MSI is stopped, MSIRDY flag goes low after 6 MSI oscillator
  *           clock cycles.
  */
#define __HAL_RCC_MSI_ENABLE()  LL_RCC_MSI_Enable()

#define __HAL_RCC_MSI_DISABLE() LL_RCC_MSI_Disable()

/** @brief  Macro to configure the Internal oscillator (MSI) frequency.
  * @param  __FREQ__ specifies the MSI frequency.
  *         This parameter can be one of the following values:
  *            @arg RCC_MSI_FREQ_4MHZ  4MHz selection (default after reset)
  *            @arg RCC_MSI_FREQ_16MHZ 16MHz selection
  */
#define __HAL_RCC_MSI_FREQUENCY_CONFIG(__FREQ__) LL_RCC_MSI_SetFrequency((uint32_t)(__FREQ__))

/** @brief  Macro to adjust the Internal oscillator (MSI) calibration value.
  * @note   The calibration is used to compensate for the variations in voltage
  *         and temperature that influence the frequency of the internal MSI RC.
  * @param  __MSICALIBRATIONVALUE__ specifies the calibration trimming value
  *         (default is RCC_MSICALIBRATION_DEFAULT).
  *         This parameter must be a number between 0 and 0x1F.
  * @retval None
  */
#define __HAL_RCC_MSI_CALIBRATIONVALUE_ADJUST(__MSICALIBRATIONVALUE__) \
  LL_RCC_MSI_SetCalibTrimming((uint32_t)(__MSICALIBRATIONVALUE__))

/**
  * @brief  Macros to enable or disable the force of the Low-power Internal oscillator (MSI)
  *         in STOP mode to be quickly available as kernel clock for USARTs and I2Cs.
  * @note   Keeping the MSI ON in STOP mode allows to avoid slowing down the communication
  *         speed because of the MSI start-up time.
  * @note   The enable of this function has not effect on the MSION bit.
  *         This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
#define __HAL_RCC_MSISTOP_ENABLE()     LL_RCC_MSI_EnableInStopMode()

#define __HAL_RCC_MSISTOP_DISABLE()    LL_RCC_MSI_DisableInStopMode()

/** @brief  Macros to enable or disable the Internal Low Speed oscillator (LSI).
  * @note   After enabling the LSI, the application software should wait on
  *         LSIRDY flag to be set indicating that LSI clock is stable and can
  *         be used to clock the IWDG and/or the RTC.
  * @note   LSI can not be disabled if the IWDG is running.
  * @note   When the LSI is stopped, LSIRDY flag goes low after 6 LSI oscillator
  *         clock cycles.
  */
#define __HAL_RCC_LSI_ENABLE()         LL_RCC_LSI_Enable()

#define __HAL_RCC_LSI_DISABLE()        LL_RCC_LSI_Disable()

/**
  * @brief  Macros to configure the External High Speed oscillator (HSE).
  * @note   After enabling the HSE (RCC_HSE_ON or RCC_HSE_BYPASS or RCC_HSE_BYPASS_DIGITAL),
  *         the application software should wait on HSERDY flag to be set indicating that HSE clock
  *         is stable and can be used to clock the PLL and/or system clock and peripheral kernel
  *         clock source.
  * @note   HSE state can not be changed if it is used directly or through the
  *         PLL as system clock. In this case, you have to select another source
  *         of the system clock then change the HSE state (ex. disable it).
  * @note   The HSE is stopped by hardware when entering STOP and STANDBY modes.
  * @param  __STATE__ specifies the new state of the HSE.
  *         This parameter can be one of the following values:
  *            @arg @ref RCC_HSE_OFF            turn OFF the HSE oscillator, HSERDY flag goes low after
  *                                             6 HSE oscillator clock cycles.
  *            @arg @ref RCC_HSE_ON             turn ON the HSE oscillator.
  *            @arg @ref RCC_HSE_BYPASS         HSE oscillator bypassed with external clock (analog).
  *            @arg @ref RCC_HSE_BYPASS_DIGITAL HSE oscillator bypassed with external digital clock.
  */
#define __HAL_RCC_HSE_CONFIG(__STATE__)                                                 \
  do {                                                                  \
    if ((__STATE__) == RCC_HSE_ON)                                      \
    {                                                                   \
      WRITE_REG(RCC->CSR, RCC_CSR_HSEONS);                              \
    }                                                                   \
    else if ((__STATE__) == RCC_HSE_OFF)                                \
    {                                                                   \
      WRITE_REG(RCC->CCR, RCC_CCR_HSEONC);                              \
      CLEAR_BIT(RCC->HSECFGR, RCC_HSECFGR_HSEEXT | RCC_HSECFGR_HSEBYP); \
    }                                                                   \
    else if ((__STATE__) == RCC_HSE_BYPASS)                             \
    {                                                                   \
      SET_BIT(RCC->HSECFGR, RCC_HSECFGR_HSEBYP);                        \
      CLEAR_BIT(RCC->HSECFGR, RCC_HSECFGR_HSEEXT);                      \
      WRITE_REG(RCC->CSR, RCC_CSR_HSEONS);                              \
    }                                                                   \
    else if ((__STATE__) == RCC_HSE_BYPASS_DIGITAL)                     \
    {                                                                   \
      SET_BIT(RCC->HSECFGR, RCC_HSECFGR_HSEEXT | RCC_HSECFGR_HSEBYP);   \
      WRITE_REG(RCC->CSR, RCC_CSR_HSEONS);                              \
    }                                                                   \
    else                                                                \
    {                                                                   \
      WRITE_REG(RCC->CCR, RCC_CCR_HSEONC);                              \
      CLEAR_BIT(RCC->HSECFGR, RCC_HSECFGR_HSEEXT | RCC_HSECFGR_HSEBYP); \
    }                                                                   \
  } while(0)

/**
  * @brief  Macros to configure the External Low Speed oscillator (LSE).
  * @note   Transition LSE Bypass to LSE On and LSE On to LSE Bypass are not supported by this macro.
  *         User should request a transition to LSE Off first and then LSE On or LSE Bypass.
  * @note   The external input clock can have a frequency up to 1 MHz and be low swing (analog) or digital(*).
            A duty cycle close to 50% is recommended.
  * @note   As the LSE is in the Backup domain and write access is denied to
  *         this domain after reset, you have to enable write access using
  *         HAL_PWR_EnableBkUpAccess() function before to configure the LSE
  *         (to be done once after reset).
  * @note   After enabling the LSE (RCC_LSE_ON, RCC_LSE_BYPASS or RCC_LSE_BYPASS_DIGITAL), the application
  *         software should wait on LSERDY flag to be set indicating that LSE clock
  *         is stable and can be used to clock the RTC.
  * @note   If the RTC is used, the LSE bypass must not be configured in digital mode but in low swing analog mode (*)
  * @param  __STATE__ specifies the new state of the LSE.
  *         This parameter can be one of the following values:
  *            @arg @ref RCC_LSE_OFF            turn OFF the LSE oscillator, LSERDY flag goes low after
  *                                        6 LSE oscillator clock cycles.
  *            @arg @ref RCC_LSE_ON             turn ON the LSE oscillator.
  *            @arg @ref RCC_LSE_BYPASS         LSE oscillator bypassed with external clock (analog).
  *            @arg @ref RCC_LSE_BYPASS_DIGITAL LSE oscillator bypassed with external digital clock.
  */
#define __HAL_RCC_LSE_CONFIG(__STATE__) \
  do {                                               \
    if((__STATE__) == RCC_LSE_ON)                    \
    {                                                \
      WRITE_REG(RCC->CSR, RCC_CSR_LSEONS);           \
    }                                                \
    else if((__STATE__) == RCC_LSE_OFF)              \
    {                                                \
      WRITE_REG(RCC->CCR, RCC_CCR_LSEONC);           \
      CLEAR_BIT(RCC->LSECFGR, RCC_LSECFGR_LSEEXT);   \
      CLEAR_BIT(RCC->LSECFGR, RCC_LSECFGR_LSEBYP);   \
    }                                                \
    else if((__STATE__) == RCC_LSE_BYPASS)           \
    {                                                \
      SET_BIT(RCC->LSECFGR, RCC_LSECFGR_LSEBYP);     \
      CLEAR_BIT(RCC->LSECFGR, RCC_LSECFGR_LSEEXT);   \
      WRITE_REG(RCC->CSR, RCC_CSR_LSEONS);           \
    }                                                \
    else if((__STATE__) == RCC_LSE_BYPASS_DIGITAL)   \
    {                                                \
      SET_BIT(RCC->LSECFGR, RCC_LSECFGR_LSEBYP);     \
      SET_BIT(RCC->LSECFGR, RCC_LSECFGR_LSEEXT);     \
      WRITE_REG(RCC->CSR, RCC_CSR_LSEONS);           \
    }                                                \
    else                                             \
    {                                                \
      WRITE_REG(RCC->CCR, RCC_CCR_LSEONC);           \
      CLEAR_BIT(RCC->LSECFGR, RCC_LSECFGR_LSEBYP);   \
      CLEAR_BIT(RCC->LSECFGR, RCC_LSECFGR_LSEEXT);   \
    }                                                \
  } while(0)

/** @brief  Macros to enable or disable the the RTC clock.
  * @note   These macros must be used only after the RTC clock source was selected.
  */
#define __HAL_RCC_RTC_ENABLE()         LL_RCC_EnableRTC()

#define __HAL_RCC_RTC_DISABLE()        LL_RCC_DisableRTC()

/** @brief  Macro to configure the RTC clock (RTCCLK).
  * @note   As the RTC clock configuration bits are in the Backup domain and write
  *         access is denied to this domain after reset, you have to enable write
  *         access using the Power Backup Access macro before to configure
  *         the RTC clock source (to be done once after reset).
  * @note   Once the RTC clock is configured it cannot be changed unless the
  *         Backup domain is reset using __HAL_RCC_BACKUPRESET_FORCE() and
  *         __HAL_RCC_BACKUPRESET_RELEASE() macros, or by a Power On Reset (POR).
  * @param  __RTC_CLKSOURCE__ specifies the RTC clock source.
  *         This parameter can be one of the following values:
  *            RCC_RTCCLKSOURCE_LSE      LSE selected as RTC clock.
  *            RCC_RTCCLKSOURCE_LSI      LSI selected as RTC clock.
  *            RCC_RTCCLKSOURCE_HSE_DIVx HSE clock divided by x selected
  *                                      as RTC clock, where x:[1,64]
  * @note   If the LSE or LSI is used as RTC clock source, the RTC continues to
  *         work in STOP and STANDBY modes, and can be used as wakeup source.
  *         However, when the HSE clock is used as RTC clock source, the RTC
  *         cannot be used in STOP and STANDBY modes.
  * @note   The maximum input clock frequency for RTC is 1MHz (when using HSE as
  *         RTC clock source).
  */
#define __HAL_RCC_RTC_CONFIG(__RTC_CLKSOURCE__) \
  do { \
    if (((__RTC_CLKSOURCE__) & (RCC_CCIPR7_RTCSEL)) == RCC_CCIPR7_RTCSEL) { \
      __HAL_RCC_RTC_CLKPRESCALER(__RTC_CLKSOURCE__); \
    } \
    LL_RCC_SetRTCClockSource((__RTC_CLKSOURCE__) & RCC_CCIPR7_RTCSEL); \
  } while(0)

/** @brief  Macro to configure the RTC clock prescaler for HSE for RTCCLK.
  * @param  __RTC_CLKSOURCE__ specifies the RTC clock prescaler for HSE.
  *         This parameter can be one of the following values:
  *            RCC_RTCCLKSOURCE_HSE_DIVx HSE clock divided by x selected
  *                                      as RTC clock, where x:[1,64]
  */
#define __HAL_RCC_RTC_CLKPRESCALER(__RTC_CLKSOURCE__) \
  LL_RCC_SetRTC_HSEPrescaler(((__RTC_CLKSOURCE__) & (~RCC_CCIPR7_RTCSEL)))

/** @brief  Macros to get the RTC clock (RTCCLK).
  * @retval The returned value can be one of the following values:
  *            RCC_RTCCLKSOURCE_DISABLE  No clock selected as RTC clock.
  *            RCC_RTCCLKSOURCE_LSE      LSE selected as RTC clock.
  *            RCC_RTCCLKSOURCE_LSI      LSI selected as RTC clock.
  *            RCC_RTCCLKSOURCE_HSE_DIVx HSE clock divided by x selected
  *                                      as RTC clock, where x:[1,64]
  */
#define __HAL_RCC_GET_RTC_SOURCE() \
  ((READ_BIT(RCC->CCIPR7, RCC_CCIPR7_RTCSEL) == RCC_CCIPR7_RTCSEL) ? \
   (READ_BIT(RCC->CCIPR7, RCC_CCIPR7_RTCPRE) | RCC_CCIPR7_RTCSEL) : READ_BIT(RCC->CCIPR7, RCC_CCIPR7_RTCSEL))

/** @brief  Macros to force or release the Vswitch backup domain reset.
  * @note   This function resets the RTC peripheral (including the backup registers)
  *         and the RTC clock source selection in RCC_BDCR register.
  * @note   The BKPSRAM is not affected by this reset.
  */
#define __HAL_RCC_BACKUPRESET_FORCE()   LL_RCC_ForceBackupDomainReset()

#define __HAL_RCC_BACKUPRESET_RELEASE() LL_RCC_ReleaseBackupDomainReset()

