micropython/micropython/lib/stm32n6/STM32N6xx_HAL_Driver/Inc/stm32n6xx_hal_rcc.h
/** @brief  Macros to enable or disable the PLL1.
  * @note   After enabling the PLL1, the application software should wait on
  *         PLL1RDY flag to be set indicating that PLL1 clock is stable and can
  *         be used as CPU and/or system bus and/or kernel clock source thru ICx.
  * @note   The PLL1 can not be disabled if it is used as system clock source
  * @note   The PLL1 is disabled by hardware when entering STOP and STANDBY modes.
  */
#define __HAL_RCC_PLL1_ENABLE()        LL_RCC_PLL1_Enable()

#define __HAL_RCC_PLL1_DISABLE()       LL_RCC_PLL1_Disable()

/**
  * @brief  Macros to enable or disable the PLL1 post divider 1, post divider 2
  *         and PLL1 clock output when not in bypass mode.
  */
#define __HAL_RCC_PLL1CLKOUT_ENABLE()       LL_RCC_PLL1P_Enable()
#define __HAL_RCC_PLL1CLKOUT_DISABLE()      LL_RCC_PLL1P_Disable()

/**
  * @brief  Macro to configure the PLL1 in integer mode with clock source, multiplication
  *         and division factors.
  * @note   This macro must be used only when the PLL1 is disabled or the PLL1 output is bypassed
  *         and driven by the PLL reference clock. This macro switches off the bypass mode.
  *
  * @param  __PLLSOURCE__ specifies the PLL entry clock source.
  *           This parameter can be one of the following values:
  *             @arg @ref RCC_PLLSOURCE_HSI HSI oscillator clock selected as PLL clock entry
  *             @arg @ref RCC_PLLSOURCE_MSI MSI oscillator clock selected as PLL clock entry
  *             @arg @ref RCC_PLLSOURCE_HSE HSE oscillator clock selected as PLL clock entry
  *             @arg @ref RCC_PLLSOURCE_PIN I2S_CKIN clock selected as PLL clock entry
  * @note   This clock source cannot be changed on any PLL if another PLL is already enabled.
  *
  * @param  __PLLM__ specifies the division factor for PLL VCO input clock.
  *           This parameter must be a number between 1 and 63.
  * @note   You have to set the PLLM parameter correctly to ensure that the VCO input
  *         frequency ranges from 1 to 50 MHz.
  *
  * @param  __PLLN__ specifies the multiplication factor for PLL VCO output clock.
  *           This parameter must be a number between 16 and 2500.
  *
  * @param  __PLLP1__ specifies the post division factor 1 for system  clock.
  *           This parameter must be a number between 1 and 7.
  *
  * @param  __PLLP2__ specifies the post division factor 2 for system  clock.
  *           This parameter must be a number between 1 and 7.
  *
  * @retval None
  */

#define __HAL_RCC_PLL1_CONFIG(__PLLSOURCE__, __PLLM__, __PLLN__, __PLLP1__, __PLLP2__) \
  do { \
    MODIFY_REG(RCC->PLL1CFGR1, (RCC_PLL1CFGR1_PLL1SEL | RCC_PLL1CFGR1_PLL1BYP | RCC_PLL1CFGR1_PLL1DIVM | RCC_PLL1CFGR1_PLL1DIVN), \
               ((__PLLSOURCE__) | ( (__PLLM__) << RCC_PLL1CFGR1_PLL1DIVM_Pos) | (((__PLLN__) << RCC_PLL1CFGR1_PLL1DIVN_Pos))));  \
    MODIFY_REG(RCC->PLL1CFGR2, RCC_PLL1CFGR2_PLL1DIVNFRAC, 0U); \
    MODIFY_REG(RCC->PLL1CFGR3, (RCC_PLL1CFGR3_PLL1PDIV1 | RCC_PLL1CFGR3_PLL1PDIV2), \
               ((((__PLLP1__) << RCC_PLL1CFGR3_PLL1PDIV1_Pos) & RCC_PLL1CFGR3_PLL1PDIV1) | \
                ((((__PLLP2__) << RCC_PLL1CFGR3_PLL1PDIV2_Pos) & RCC_PLL1CFGR3_PLL1PDIV2)))); \
  } while(0)

/** @brief  Macro to configure the PLL1 clock source.
  * @note   This macro must be used only when the PLL1 is disabled or the PLL1 output is bypassed
  *         and driven by the PLL reference clock. This macro switches off the bypass mode.
  *
  * @param  __PLLSOURCE__ specifies the PLL entry clock source.
  *         This parameter can be one of the following values:
  *            @arg @ref RCC_PLLSOURCE_HSI  HSI oscillator clock selected as PLL clock entry
  *            @arg @ref RCC_PLLSOURCE_MSI  MSI oscillator clock selected as PLL clock entry
  *            @arg @ref RCC_PLLSOURCE_HSE  HSE oscillator clock selected as PLL clock entry
  *            @arg @ref RCC_PLLSOURCE_PIN  External I2S_CKIN clock selected as PLL clock entry
  */
#define __HAL_RCC_PLL1_PLLSOURCE_CONFIG(__PLLSOURCE__)  LL_RCC_PLL1_SetSource((uin32_t)__PLLSOURCE__)

/** @brief  Macro to get the clock source used as PLL1 clock source.
  * @retval The oscillator used as PLL clock source.
  *         The returned value can be one of the following values:
  *            @arg @ref RCC_PLLSOURCE_HSI  HSI oscillator is used as PLL clock source.
  *            @arg @ref RCC_PLLSOURCE_MSI  MSI oscillator is used as PLL clock source.
  *            @arg @ref RCC_PLLSOURCE_HSE  HSE oscillator is used as PLL clock source.
  *            @arg @ref RCC_PLLSOURCE_PIN  External I2S_CKIN is used as PLL clock source.
  */
#define __HAL_RCC_GET_PLL1_OSCSOURCE()  LL_RCC_PLL1_GetSource()

/**
  * @brief  Macro to configure the PLL1 clock Fractional Part Of The Multiplication Factor
  * @note   This configuration cannot be requested when the PLL1 has been enabled.
  *
  * @param  __PLLDIVNFRAC__ specifies Fractional Part Of The Multiplication Factor for PLL1 VCO.
  *                         It should be a value between 0 and 2^24.
  * @retval None
  */
#define  __HAL_RCC_PLL1_DIVNFRAC_CONFIG(__PLLDIVNFRAC__) LL_RCC_PLL1_SetFRACN((uint32_t)(__PLLDIVNFRAC__))

/**
  * @brief  Macro to enable the PLL1 clock Fractional mode
  * @note   This configuration cannot be requested when the PLL1 has been enabled.
  * @retval None
  */
#define  __HAL_RCC_PLL1_FRACN_ENABLE() LL_RCC_PLL1_EnableFractionalModulationSpreadSpectrum()

/**
  * @brief  Macro to disable the PLL1 clock Fractional mode
  * @note   This configuration cannot be requested when the PLL1 has been enabled.
  * @retval None
  */
#define  __HAL_RCC_PLL1_FRACN_DISABLE() LL_RCC_PLL1_DisableFractionalModulationSpreadSpectrum()

/** @brief  Macros to enable or disable PLL2.
  * @note   After enabling PLL2, the application software should wait on
  *         PLL2RDY flag to be set indicating that PLL2 clock is stable and can
  *         be used as CPU and/or system bus and/or kernel clock source thru ICx.
  * @note   PLL2 is disabled by hardware when entering Stop and Standby modes.
  */
#define __HAL_RCC_PLL2_ENABLE()         LL_RCC_PLL2_Enable()
#define __HAL_RCC_PLL2_DISABLE()        LL_RCC_PLL2_Disable()

/**
  * @brief  Macros to enable or disable the PLL2 post divider 1, post divider 2
  *         and PLL2 clock output when not in bypass mode.
  */
#define __HAL_RCC_PLL2CLKOUT_ENABLE()       LL_RCC_PLL2P_Enable()
#define __HAL_RCC_PLL2CLKOUT_DISABLE()      LL_RCC_PLL2P_Disable()

/**
  * @brief  Macro to configure the PLL2 in integer mode with clock source, multiplication
  *         and division factors.
  * @note   This macro must be used only when the PLL2 is disabled or the PLL2 output is bypassed
  *         and driven by the PLL reference clock. This macro switches off the bypass mode.
  *
  * @param  __PLLSOURCE__ specifies the PLL entry clock source.
  *           This parameter can be one of the following values:
  *             @arg @ref RCC_PLLSOURCE_HSI HSI oscillator clock selected as PLL clock entry
  *             @arg @ref RCC_PLLSOURCE_MSI MSI oscillator clock selected as PLL clock entry
  *             @arg @ref RCC_PLLSOURCE_HSE HSE oscillator clock selected as PLL clock entry
  *             @arg @ref RCC_PLLSOURCE_PIN I2S_CKIN clock selected as PLL clock entry
  * @note   This clock source cannot be changed on any PLL if another PLL is already enabled.
  *
  * @param  __PLLM__ specifies the division factor for PLL VCO input clock
  *           This parameter must be a number between 1 and 63.
  * @note   You have to set the PLLM parameter correctly to ensure that the VCO input
  *         frequency ranges from 1 to 50 MHz.
  *
  * @param  __PLLN__ specifies the multiplication factor for PLL VCO output clock
  *           This parameter must be a number between 16 and 2500.
  * @param  __PLLP1__ specifies the post division factor 1 for system  clock.
  *           This parameter must be a number between 1 and 7.
  * @param  __PLLP2__ specifies the post division factor 2 for system  clock.
  *           This parameter must be a number between 1 and 7.
  *
  * @retval None
  */

#define __HAL_RCC_PLL2_CONFIG(__PLLSOURCE__, __PLLM__, __PLLN__, __PLLP1__, __PLLP2__) \
  do { \
    MODIFY_REG(RCC->PLL2CFGR1, (RCC_PLL2CFGR1_PLL2SEL | RCC_PLL2CFGR1_PLL2BYP | RCC_PLL2CFGR1_PLL2DIVM | RCC_PLL2CFGR1_PLL2DIVN), \
               ((__PLLSOURCE__) | ( (__PLLM__) << RCC_PLL2CFGR1_PLL2DIVM_Pos) | (((__PLLN__) << RCC_PLL2CFGR1_PLL2DIVN_Pos))));  \
    MODIFY_REG(RCC->PLL2CFGR2, RCC_PLL2CFGR2_PLL2DIVNFRAC, 0U); \
    MODIFY_REG(RCC->PLL2CFGR3, (RCC_PLL2CFGR3_PLL2PDIV1 | RCC_PLL2CFGR3_PLL2PDIV2), \
               ((((__PLLP1__) << RCC_PLL2CFGR3_PLL2PDIV1_Pos) & RCC_PLL2CFGR3_PLL2PDIV1) | \
                ((((__PLLP2__) << RCC_PLL2CFGR3_PLL2PDIV2_Pos) & RCC_PLL2CFGR3_PLL2PDIV2)))); \
  } while(0)


/** @brief  Macro to configure the PLL2 clock source.
  * @note   This macro must be used only when the PLL2 is disabled or the PLL2 output is bypassed
  *         and driven by the PLL reference clock. This macro switches off the bypass mode.
  *
  * @param  __PLLSOURCE__ specifies the PLL entry clock source.
  *           This parameter can be one of the following values:
  *              @arg @ref RCC_PLLSOURCE_HSI  HSI oscillator clock selected as PLL clock entry
  *              @arg @ref RCC_PLLSOURCE_MSI  MSI oscillator clock selected as PLL clock entry
  *              @arg @ref RCC_PLLSOURCE_HSE  HSE oscillator clock selected as PLL clock entry
  *              @arg @ref RCC_PLLSOURCE_PIN  External I2S_CKIN clock selected as PLL clock entry
  */
#define __HAL_RCC_PLL2_PLLSOURCE_CONFIG(__PLLSOURCE__) LL_RCC_PLL2_SetSource((uin32_t)__PLLSOURCE__)

/** @brief  Macro to get the clock source used as PLL2 clock source.
  * @retval The oscillator used as PLL clock source.
  *         The returned value can be one of the following values:
  *            @arg @ref RCC_PLLSOURCE_HSI  HSI oscillator is used as PLL clock source.
  *            @arg @ref RCC_PLLSOURCE_MSI  MSI oscillator is used as PLL clock source.
  *            @arg @ref RCC_PLLSOURCE_HSE  HSE oscillator is used as PLL clock source.
  *            @arg @ref RCC_PLLSOURCE_PIN  External I2S_CKIN is used as PLL clock source.
  */
#define __HAL_RCC_GET_PLL2_OSCSOURCE() LL_RCC_PLL2_GetSource()

/**
  * @brief  Macro to configure the PLL2 clock Fractional Part Of The Multiplication Factor
  * @note   This configuration cannot be requested when the PLL2 has been enabled.
  *
  * @param  __PLLDIVNFRAC__ specifies Fractional Part Of The Multiplication Factor for PLL2 VCO.
  *                         It should be a value between 0 and 2^24.
  * @retval None
  */
#define  __HAL_RCC_PLL2_DIVNFRAC_CONFIG(__PLLDIVNFRAC__) LL_RCC_PLL2_SetFRACN((uint32_t)(__PLLDIVNFRAC__))

/**
  * @brief  Macro to enable the PLL2 clock Fractional mode
  * @note   This configuration cannot be requested when the PLL2 has been enabled.
  * @retval None
  */
#define  __HAL_RCC_PLL2_FRACN_ENABLE() LL_RCC_PLL2_EnableFractionalModulationSpreadSpectrum()

/**
  * @brief  Macro to disable the PLL2 clock Fractional mode
  * @note   This configuration cannot be requested when the PLL2 has been enabled.
  * @retval None
  */
#define  __HAL_RCC_PLL2_FRACN_DISABLE() LL_RCC_PLL2_DisableFractionalModulationSpreadSpectrum()

/** @brief  Macros to enable or disable PLL3.
  * @note   After enabling PLL3, the application software should wait on
  *         PLL3RDY flag to be set indicating that PLL3 clock is stable and can
  *         be used as CPU and/or system bus and/or kernel clock source thru ICx.
  * @note   PLL3 is disabled by hardware when entering Stop and Standby modes.
  */
#define __HAL_RCC_PLL3_ENABLE()         LL_RCC_PLL3_Enable()
#define __HAL_RCC_PLL3_DISABLE()        LL_RCC_PLL3_Disable()

/**
  * @brief  Macros to enable or disable the PLL3 post divider 1, post divider 2
  *         and PLL3 clock output when not in bypass mode.
  */
#define __HAL_RCC_PLL3CLKOUT_ENABLE()       LL_RCC_PLL3P_Enable()
#define __HAL_RCC_PLL3CLKOUT_DISABLE()      LL_RCC_PLL3P_Disable()

/**
  * @brief  Macro to configure the PLL3 in integer mode with clock source, multiplication
  *         and division factors.
  * @note   This macro must be used only when the PLL3 is disabled or the PLL3 output is bypassed
  *         and driven by the PLL reference clock. This macro switches off the bypass mode.
  *
  * @param  __PLLSOURCE__ specifies the PLL entry clock source.
  *           This parameter can be one of the following values:
  *             @arg @ref RCC_PLLSOURCE_HSI HSI oscillator clock selected as PLL clock entry
  *             @arg @ref RCC_PLLSOURCE_MSI MSI oscillator clock selected as PLL clock entry
  *             @arg @ref RCC_PLLSOURCE_HSE HSE oscillator clock selected as PLL clock entry
  *             @arg @ref RCC_PLLSOURCE_PIN I2S_CKIN clock selected as PLL clock entry
  * @note   This clock source cannot be changed on any PLL if another PLL is already enabled.
  *
  * @param  __PLLM__ specifies the division factor for PLL VCO input clock
  *           This parameter must be a number between 1 and 63.
  * @note   You have to set the PLLM parameter correctly to ensure that the VCO input
  *         frequency ranges from 1 to 50 MHz.
  *
  * @param  __PLLN__ specifies the multiplication factor for PLL VCO output clock
  *           This parameter must be a number between 16 and 2500.
  * @param  __PLLP1__ specifies the post division factor 1 for system  clock.
  *           This parameter must be a number between 1 and 7.
  * @param  __PLLP2__ specifies the post division factor 2 for system  clock.
  *           This parameter must be a number between 1 and 7.
  *
  * @retval None
  */

#define __HAL_RCC_PLL3_CONFIG(__PLLSOURCE__, __PLLM__, __PLLN__, __PLLP1__, __PLLP2__) \
  do { \
    MODIFY_REG(RCC->PLL3CFGR1, (RCC_PLL3CFGR1_PLL3SEL | RCC_PLL3CFGR1_PLL3BYP | RCC_PLL3CFGR1_PLL3DIVM | RCC_PLL3CFGR1_PLL3DIVN), \
               ((__PLLSOURCE__) | ( (__PLLM__) << RCC_PLL3CFGR1_PLL3DIVM_Pos) | (((__PLLN__) << RCC_PLL3CFGR1_PLL3DIVN_Pos))));  \
    MODIFY_REG(RCC->PLL3CFGR2, RCC_PLL3CFGR2_PLL3DIVNFRAC, 0U); \
    MODIFY_REG(RCC->PLL3CFGR3, (RCC_PLL3CFGR3_PLL3PDIV1 | RCC_PLL3CFGR3_PLL3PDIV2), \
               ((((__PLLP1__) << RCC_PLL3CFGR3_PLL3PDIV1_Pos) & RCC_PLL3CFGR3_PLL3PDIV1) | \
                ((((__PLLP2__) << RCC_PLL3CFGR3_PLL3PDIV2_Pos) & RCC_PLL3CFGR3_PLL3PDIV2)))); \
  } while(0)


/** @brief  Macro to configure the PLL3 clock source.
  * @note   This macro must be used only when the PLL3 is disabled or the PLL3 output is bypassed
  *         and driven by the PLL reference clock. This macro switches off the bypass mode.
  *
  * @param  __PLLSOURCE__ specifies the PLL entry clock source.
  *           This parameter can be one of the following values:
  *              @arg @ref RCC_PLLSOURCE_HSI  HSI oscillator clock selected as PLL clock entry
  *              @arg @ref RCC_PLLSOURCE_MSI  MSI oscillator clock selected as PLL clock entry
  *              @arg @ref RCC_PLLSOURCE_HSE  HSE oscillator clock selected as PLL clock entry
  *              @arg @ref RCC_PLLSOURCE_PIN  External I2S_CKIN clock selected as PLL clock entry
  */
#define __HAL_RCC_PLL3_PLLSOURCE_CONFIG(__PLLSOURCE__) LL_RCC_PLL3_SetSource((uin32_t)__PLLSOURCE__)

/** @brief  Macro to get the clock source used as PLL3 clock source.
  * @retval The oscillator used as PLL clock source.
  *         The returned value can be one of the following values:
  *            @arg @ref RCC_PLLSOURCE_HSI  HSI oscillator is used as PLL clock source.
  *            @arg @ref RCC_PLLSOURCE_MSI  MSI oscillator is used as PLL clock source.
  *            @arg @ref RCC_PLLSOURCE_HSE  HSE oscillator is used as PLL clock source.
  *            @arg @ref RCC_PLLSOURCE_PIN  External I2S_CKIN is used as PLL clock source.
  */
#define __HAL_RCC_GET_PLL3_OSCSOURCE() LL_RCC_PLL3_GetSource()

/**
  * @brief  Macro to configure the PLL3 clock Fractional Part Of The Multiplication Factor
  * @note   This configuration cannot be requested when the PLL3 has been enabled.
  *
  * @param  __PLLDIVNFRAC__ specifies Fractional Part Of The Multiplication Factor for PLL3 VCO.
  *                         It should be a value between 0 and 2^24.
  * @retval None
  */
#define  __HAL_RCC_PLL3_DIVNFRAC_CONFIG(__PLLDIVNFRAC__) LL_RCC_PLL3_SetFRACN((uint32_t)(__PLLDIVNFRAC__))

/**
  * @brief  Macro to enable the PLL3 clock Fractional mode
  * @note   This configuration cannot be requested when the PLL3 has been enabled.
  * @retval None
  */
#define  __HAL_RCC_PLL3_FRACN_ENABLE() LL_RCC_PLL3_EnableFractionalModulationSpreadSpectrum()

/**
  * @brief  Macro to disable the PLL3 clock Fractional mode
  * @note   This configuration cannot be requested when the PLL3 has been enabled.
  * @retval None
  */
#define  __HAL_RCC_PLL3_FRACN_DISABLE() LL_RCC_PLL3_DisableFractionalModulationSpreadSpectrum()

/** @brief  Macros to enable or disable PLL4.
  * @note   After enabling PLL4, the application software should wait on
  *         PLL4RDY flag to be set indicating that PLL4 clock is stable and can
  *         be used as CPU and/or system bus and/or kernel clock source thru ICx.
  * @note   PLL4 is disabled by hardware when entering Stop and Standby modes.
  */
#define __HAL_RCC_PLL4_ENABLE()         LL_RCC_PLL4_Enable()
#define __HAL_RCC_PLL4_DISABLE()        LL_RCC_PLL4_Disable()

/**
  * @brief  Macros to enable or disable the PLL4 post divider 1, post divider 2
  *         and PLL4 clock output when not in bypass mode.
  */
#define __HAL_RCC_PLL4CLKOUT_ENABLE()       LL_RCC_PLL4P_Enable()
#define __HAL_RCC_PLL4CLKOUT_DISABLE()      LL_RCC_PLL4P_Disable()

/**
  * @brief  Macro to configure the PLL4 in integer mode with clock source, multiplication
  *         and division factors.
  * @note   This macro must be used only when the PLL4 is disabled or the PLL4 output is bypassed
  *         and driven by the PLL reference clock. This macro switches off the bypass mode.
  *
  * @param  __PLLSOURCE__ specifies the PLL entry clock source.
  *           This parameter can be one of the following values:
  *             @arg @ref RCC_PLLSOURCE_HSI HSI oscillator clock selected as PLL clock entry
  *             @arg @ref RCC_PLLSOURCE_MSI MSI oscillator clock selected as PLL clock entry
  *             @arg @ref RCC_PLLSOURCE_HSE HSE oscillator clock selected as PLL clock entry
  *             @arg @ref RCC_PLLSOURCE_PIN I2S_CKIN clock selected as PLL clock entry
  * @note   This clock source cannot be changed on any PLL if another PLL is already enabled.
  *
  * @param  __PLLM__ specifies the division factor for PLL VCO input clock
  *           This parameter must be a number between 1 and 63.
  * @note   You have to set the PLLM parameter correctly to ensure that the VCO input
  *         frequency ranges from 1 to 50 MHz.
  *
  * @param  __PLLN__ specifies the multiplication factor for PLL VCO output clock
  *           This parameter must be a number between 16 and 2500.
  * @param  __PLLP1__ specifies the post division factor 1 for system  clock.
  *           This parameter must be a number between 1 and 7.
  * @param  __PLLP2__ specifies the post division factor 2 for system  clock.
  *           This parameter must be a number between 1 and 7.
  *
  * @retval None
  */

#define __HAL_RCC_PLL4_CONFIG(__PLLSOURCE__, __PLLM__, __PLLN__, __PLLP1__, __PLLP2__) \
  do { \
    MODIFY_REG(RCC->PLL4CFGR1, (RCC_PLL4CFGR1_PLL4SEL | RCC_PLL4CFGR1_PLL4BYP | RCC_PLL4CFGR1_PLL4DIVM | RCC_PLL4CFGR1_PLL4DIVN), \
               ((__PLLSOURCE__) | ( (__PLLM__) << RCC_PLL4CFGR1_PLL4DIVM_Pos) | (((__PLLN__) << RCC_PLL4CFGR1_PLL4DIVN_Pos))));  \
    MODIFY_REG(RCC->PLL4CFGR2, RCC_PLL4CFGR2_PLL4DIVNFRAC, 0U); \
    MODIFY_REG(RCC->PLL4CFGR3, (RCC_PLL4CFGR3_PLL4PDIV1 | RCC_PLL4CFGR3_PLL4PDIV2), \
               ((((__PLLP1__) << RCC_PLL4CFGR3_PLL4PDIV1_Pos) & RCC_PLL4CFGR3_PLL4PDIV1) | \
                ((((__PLLP2__) << RCC_PLL4CFGR3_PLL4PDIV2_Pos) & RCC_PLL4CFGR3_PLL4PDIV2)))); \
  } while(0)


/** @brief  Macro to configure the PLL4 clock source.
  * @note   This macro must be used only when the PLL4 is disabled or the PLL4 output is bypassed
  *         and driven by the PLL reference clock. This macro switches off the bypass mode.
  * @param  __PLLSOURCE__ specifies the PLL entry clock source.
  *         This parameter can be one of the following values:
  *            @arg @ref RCC_PLLSOURCE_HSI  HSI oscillator clock selected as PLL clock entry
  *            @arg @ref RCC_PLLSOURCE_MSI  MSI oscillator clock selected as PLL clock entry
  *            @arg @ref RCC_PLLSOURCE_HSE  HSE oscillator clock selected as PLL clock entry
  *            @arg @ref RCC_PLLSOURCE_PIN  External I2S_CKIN clock selected as PLL clock entry
  */
#define __HAL_RCC_PLL4_PLLSOURCE_CONFIG(__PLLSOURCE__) LL_RCC_PLL4_SetSource((uin32_t)__PLLSOURCE__)

/** @brief  Macro to get the clock source used as PLL4 clock source.
  * @retval The oscillator used as PLL clock source.
  *         The returned value can be one of the following values:
  *            @arg @ref RCC_PLLSOURCE_HSI  HSI oscillator is used as PLL clock source.
  *            @arg @ref RCC_PLLSOURCE_MSI  MSI oscillator is used as PLL clock source.
  *            @arg @ref RCC_PLLSOURCE_HSE  HSE oscillator is used as PLL clock source.
  *            @arg @ref RCC_PLLSOURCE_PIN  External I2S_CKIN is used as PLL clock source.
  */
#define __HAL_RCC_GET_PLL4_OSCSOURCE() LL_RCC_PLL4_GetSource()

/**
  * @brief  Macro to configure the PLL4 clock Fractional Part Of The Multiplication Factor
  * @note   This configuration cannot be requested when the PLL4 has been enabled.
  *
  * @param  __PLLDIVNFRAC__ specifies Fractional Part Of The Multiplication Factor for PLL4 VCO.
  *                         It should be a value between 0 and 2^24.
  * @retval None
  */
#define  __HAL_RCC_PLL4_DIVNFRAC_CONFIG(__PLLDIVNFRAC__)  LL_RCC_PLL4_SetFRACN((uint32_t)(__PLLDIVNFRAC__))

/**
  * @brief  Macro to enable the PLL4 clock Fractional mode
  * @note   This configuration cannot be requested when the PLL4 has been enabled.
  * @retval None
  */
#define  __HAL_RCC_PLL4_FRACN_ENABLE() LL_RCC_PLL4_EnableFractionalModulationSpreadSpectrum()


/**
  * @brief  Macro to disable the PLL4 clock Fractional mode
  * @note   This configuration cannot be requested when the PLL4 has been enabled.
  * @retval None
  */
#define  __HAL_RCC_PLL4_FRACN_DISABLE()  LL_RCC_PLL4_DisableFractionalModulationSpreadSpectrum()

/**
  * @brief Macro to configure the CPU clock source.
  * @param  __CPUCLKSOURCE__ specifies the CPU clock source.
  *         This parameter can be one of the following values:
  *            @arg @ref RCC_CPUCLKSOURCE_HSI    HSI oscillator is used as CPU clock source.
  *            @arg @ref RCC_CPUCLKSOURCE_MSI    MSI oscillator is used as CPU clock source.
  *            @arg @ref RCC_CPUCLKSOURCE_HSE    HSE oscillator is used as CPU clock source.
  *            @arg @ref RCC_CPUCLKSOURCE_IC1    IC1 output is used as CPU clock source.
  * @retval None
  */
#define __HAL_RCC_CPUCLK_CONFIG(__CPUCLKSOURCE__) LL_RCC_SetCpuClkSource((uint32_t)(__CPUCLKSOURCE__))

/** @brief  Macro to get the clock source used as CPU clock.
  * @retval The clock source used as CPU clock.
  *         The returned value can be one of the following values:
  *            @arg @ref RCC_CPUCLKSOURCE_STATUS_HSI    HSI used as CPU clock.
  *            @arg @ref RCC_CPUCLKSOURCE_STATUS_MSI    MSI used as CPU clock.
  *            @arg @ref RCC_CPUCLKSOURCE_STATUS_HSE    HSE used as CPU clock.
  *            @arg @ref RCC_CPUCLKSOURCE_STATUS_IC1    IC1 used as CPU clock.
  */
#define __HAL_RCC_GET_CPUCLK_SOURCE() LL_RCC_GetCpuClkSource()


