micropython/micropython/lib/stm32n6/STM32N6xx_HAL_Driver/Inc/stm32n6xx_hal_rcc.h
#define IS_RCC_MCO(__MCOX__) (((__MCOX__) == RCC_MCO1) || ((__MCOX__) == RCC_MCO2))

#define IS_RCC_MCO1SOURCE(__SOURCE__) (((__SOURCE__) == RCC_MCO1SOURCE_LSI)  || ((__SOURCE__) == RCC_MCO1SOURCE_LSE)  || \
                                       ((__SOURCE__) == RCC_MCO1SOURCE_MSI)  || ((__SOURCE__) == RCC_MCO1SOURCE_HSI)  || \
                                       ((__SOURCE__) == RCC_MCO1SOURCE_HSE)  || ((__SOURCE__) == RCC_MCO1SOURCE_IC5)  || \
                                       ((__SOURCE__) == RCC_MCO1SOURCE_IC10) || ((__SOURCE__) == RCC_MCO1SOURCE_SYSA))

#define IS_RCC_MCO2SOURCE(__SOURCE__) (((__SOURCE__) == RCC_MCO2SOURCE_LSI)  || ((__SOURCE__) == RCC_MCO2SOURCE_LSE)  || \
                                       ((__SOURCE__) == RCC_MCO2SOURCE_MSI)  || ((__SOURCE__) == RCC_MCO2SOURCE_HSI)  || \
                                       ((__SOURCE__) == RCC_MCO2SOURCE_HSE)  || ((__SOURCE__) == RCC_MCO2SOURCE_IC15) || \
                                       ((__SOURCE__) == RCC_MCO2SOURCE_IC20) || ((__SOURCE__) == RCC_MCO2SOURCE_SYSB))

#define IS_RCC_MCODIV(__DIV__) (((__DIV__) == RCC_MCODIV_1)  || ((__DIV__) == RCC_MCODIV_2)   || \
                                ((__DIV__) == RCC_MCODIV_3)  || ((__DIV__) == RCC_MCODIV_4)   || \
                                ((__DIV__) == RCC_MCODIV_5)  || ((__DIV__) == RCC_MCODIV_6)   || \
                                ((__DIV__) == RCC_MCODIV_7)  || ((__DIV__) == RCC_MCODIV_8)   || \
                                ((__DIV__) == RCC_MCODIV_9)  || ((__DIV__) == RCC_MCODIV_10)  || \
                                ((__DIV__) == RCC_MCODIV_11) || ((__DIV__) == RCC_MCODIV_12)  || \
                                ((__DIV__) == RCC_MCODIV_13) || ((__DIV__) == RCC_MCODIV_14)  || \
                                ((__DIV__) == RCC_MCODIV_15) || ((__DIV__) == RCC_MCODIV_16))

#define IS_RCC_HSI_CALIBRATION_VALUE(__VALUE__) ((__VALUE__) <= 0x7FU)

#define IS_RCC_MSI_CALIBRATION_VALUE(__VALUE__) ((__VALUE__) <= 0x1FU)

#define IS_RCC_STOP_WAKEUPCLOCK(__SOURCE__) (((__SOURCE__) == RCC_STOP_WAKEUPCLOCK_MSI) || \
                                             ((__SOURCE__) == RCC_STOP_WAKEUPCLOCK_HSI))

#define IS_RCC_ICCLKSOURCE(__SOURCE__) (((__SOURCE__) == RCC_ICCLKSOURCE_PLL1) || \
                                        ((__SOURCE__) == RCC_ICCLKSOURCE_PLL2) || \
                                        ((__SOURCE__) == RCC_ICCLKSOURCE_PLL3)  || \
                                        ((__SOURCE__) == RCC_ICCLKSOURCE_PLL4))

#define IS_RCC_ICCLKDIVIDER(__VALUE__) ((1U <= (__VALUE__)) && ((__VALUE__) <= 256U))

#define IS_RCC_ITEM_ATTRIBUTES(ITEM)  ((((ITEM) & RCC_ITEM_ALL) != 0U) && (((ITEM) & ~RCC_ITEM_ALL) == 0U))

#define IS_RCC_SINGLE_ITEM_ATTRIBUTES(ITEM) (((ITEM) == RCC_ITEM_LSI)         || \
                                             ((ITEM) == RCC_ITEM_LSE)         || \
                                             ((ITEM) == RCC_ITEM_MSI)         || \
                                             ((ITEM) == RCC_ITEM_HSI)         || \
                                             ((ITEM) == RCC_ITEM_HSE)         || \
                                             ((ITEM) == RCC_ITEM_PLL1)        || \
                                             ((ITEM) == RCC_ITEM_PLL2)        || \
                                             ((ITEM) == RCC_ITEM_PLL3)        || \
                                             ((ITEM) == RCC_ITEM_PLL4)        || \
                                             ((ITEM) == RCC_ITEM_IC1)         || \
                                             ((ITEM) == RCC_ITEM_IC2)         || \
                                             ((ITEM) == RCC_ITEM_IC3)         || \
                                             ((ITEM) == RCC_ITEM_IC4)         || \
                                             ((ITEM) == RCC_ITEM_IC5)         || \
                                             ((ITEM) == RCC_ITEM_IC6)         || \
                                             ((ITEM) == RCC_ITEM_IC7)         || \
                                             ((ITEM) == RCC_ITEM_IC8)         || \
                                             ((ITEM) == RCC_ITEM_IC9)         || \
                                             ((ITEM) == RCC_ITEM_IC10)        || \
                                             ((ITEM) == RCC_ITEM_IC11)        || \
                                             ((ITEM) == RCC_ITEM_IC12)        || \
                                             ((ITEM) == RCC_ITEM_IC13)        || \
                                             ((ITEM) == RCC_ITEM_IC14)        || \
                                             ((ITEM) == RCC_ITEM_IC15)        || \
                                             ((ITEM) == RCC_ITEM_IC16)        || \
                                             ((ITEM) == RCC_ITEM_IC17)        || \
                                             ((ITEM) == RCC_ITEM_IC18)        || \
                                             ((ITEM) == RCC_ITEM_IC19)        || \
                                             ((ITEM) == RCC_ITEM_IC20)        || \
                                             ((ITEM) == RCC_ITEM_MOD)         || \
                                             ((ITEM) == RCC_ITEM_SYS)         || \
                                             ((ITEM) == RCC_ITEM_BUS)         || \
                                             ((ITEM) == RCC_ITEM_PER)         || \
                                             ((ITEM) == RCC_ITEM_INT)         || \
                                             ((ITEM) == RCC_ITEM_RST)         || \
                                             ((ITEM) == RCC_ITEM_ACLKN)       || \
                                             ((ITEM) == RCC_ITEM_ACLKNC)      || \
                                             ((ITEM) == RCC_ITEM_AHBM)        || \
                                             ((ITEM) == RCC_ITEM_AHB1)        || \
                                             ((ITEM) == RCC_ITEM_AHB2)        || \
                                             ((ITEM) == RCC_ITEM_AHB3)        || \
                                             ((ITEM) == RCC_ITEM_AHB4)        || \
                                             ((ITEM) == RCC_ITEM_AHB5)        || \
                                             ((ITEM) == RCC_ITEM_APB1)        || \
                                             ((ITEM) == RCC_ITEM_APB2)        || \
                                             ((ITEM) == RCC_ITEM_APB3)        || \
                                             ((ITEM) == RCC_ITEM_APB4)        || \
                                             ((ITEM) == RCC_ITEM_APB5)        || \
                                             ((ITEM) == RCC_ITEM_NOC)         || \
                                             ((ITEM) == RCC_ITEM_AXISRAM3)    || \
                                             ((ITEM) == RCC_ITEM_AXISRAM4)    || \
                                             ((ITEM) == RCC_ITEM_AXISRAM5)    || \
                                             ((ITEM) == RCC_ITEM_AXISRAM6)    || \
                                             ((ITEM) == RCC_ITEM_AHBSRAM1)    || \
                                             ((ITEM) == RCC_ITEM_AHBSRAM2)    || \
                                             ((ITEM) == RCC_ITEM_BKPSRAM)     || \
                                             ((ITEM) == RCC_ITEM_AXISRAM1)    || \
                                             ((ITEM) == RCC_ITEM_AXISRAM2)    || \
                                             ((ITEM) == RCC_ITEM_FLEXRAM)     || \
                                             ((ITEM) == RCC_ITEM_CACHEAXIRAM) || \
                                             ((ITEM) == RCC_ITEM_VENCRAM))


#if defined (CPU_IN_SECURE_STATE)
#define IS_RCC_ATTRIBUTES(ATTRIBUTE) (((((ATTRIBUTE) & RCC_ATTR_SEC) == RCC_ATTR_SEC)        || \
                                       (((ATTRIBUTE) & RCC_ATTR_NSEC) == RCC_ATTR_NSEC)      || \
                                       (((ATTRIBUTE) & RCC_ATTR_PRIV) == RCC_ATTR_PRIV)      || \
                                       (((ATTRIBUTE) & RCC_ATTR_NPRIV) == RCC_ATTR_NPRIV)    || \
                                       (((ATTRIBUTE) & RCC_ATTR_PUB)  == RCC_ATTR_PUB)       || \
                                       (((ATTRIBUTE) & RCC_ATTR_NPUB) == RCC_ATTR_NPUB)      || \
                                       (((ATTRIBUTE) & RCC_ATTR_LOCK) == RCC_ATTR_LOCK))     && \
                                      (((ATTRIBUTE) & ~(RCC_ATTR_SEC|RCC_ATTR_NSEC|RCC_ATTR_PRIV|RCC_ATTR_NPRIV|\
                                                        RCC_ATTR_PUB|RCC_ATTR_NPUB|RCC_ATTR_LOCK)) == 0U))
#else
#define IS_RCC_ATTRIBUTES(ATTRIBUTE) (((((ATTRIBUTE) & RCC_ATTR_PRIV) == RCC_ATTR_PRIV) || \
                                       (((ATTRIBUTE) & RCC_ATTR_NPRIV) == RCC_ATTR_NPRIV)) && \
                                      (((ATTRIBUTE) & ~(RCC_ATTR_PRIV|RCC_ATTR_NPRIV)) == 0U))

#endif /* CPU_IN_SECURE_STATE */


/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */
#ifdef __cplusplus
}
#endif

#endif /* STM32N6xx_HAL_RCC_H */
